export const PresentationAnimation = () => {
    return (
        <p className="presentation-animation">
            <svg xmlns="http://www.w3.org/2000/svg" xlink="http://www.w3.org/1999/xlink" viewBox="0 0 455.71 325.96">
                <defs>
                    <linearGradient id="Áåçûìÿííûé_ãðàäèåíò_13" x1="-4445.53" y1="-1360.09" x2="-4445.53" y2="-1595.02">
                        <stop offset="0" stopColor="#42e8e0" />
                        <stop offset=".02" stopColor="#40deda" />
                        <stop offset=".11" stopColor="#37adbc" />
                        <stop offset=".22" stopColor="#2e82a2" />
                        <stop offset=".32" stopColor="#285e8c" />
                        <stop offset=".43" stopColor="#22417a" />
                        <stop offset=".55" stopColor="#1e2a6c" />
                        <stop offset=".67" stopColor="#1a1a63" />
                        <stop offset=".81" stopColor="#19105d" />
                        <stop offset="1" stopColor="#180d5b" />
                    </linearGradient>
                    <linearGradient id="Áåçûìÿííûé_ãðàäèåíò_13-2" x1="-4459.8" y1="-1372.45" x2="-4459.8" y2="-1607.38" href="#Áåçûìÿííûé_ãðàäèåíò_13" />
                    <linearGradient id="Áåçûìÿííûé_ãðàäèåíò_13-3" x1="-4474.08" y1="-1384.81" x2="-4474.08" y2="-1619.75" href="#Áåçûìÿííûé_ãðàäèåíò_13" />
                    <linearGradient id="Áåçûìÿííûé_ãðàäèåíò_3" x1="2462.15" y1="223.62" x2="2628.19" y2="223.62">
                        <stop offset="0" stopColor="#c0bff6" />
                        <stop offset=".29" stopColor="#c5c4f7" />
                        <stop offset=".64" stopColor="#d3d2f9" />
                        <stop offset="1" stopColor="#e9e9fd" />
                    </linearGradient>
                    <linearGradient id="Áåçûìÿííûé_ãðàäèåíò_24" x1="2462.15" y1="266.21" x2="2490.66" y2="266.21">
                        <stop offset="0" stopColor="#5761d7" />
                        <stop offset=".18" stopColor="#5c66d9" />
                        <stop offset=".39" stopColor="#6a73df" />
                        <stop offset=".61" stopColor="#8289e8" />
                        <stop offset=".85" stopColor="#a3a7f5" />
                        <stop offset="1" stopColor="#bcbeff" />
                    </linearGradient>
                    <linearGradient id="Áåçûìÿííûé_ãðàäèåíò_24-2" x1="2484.4" y1="314.07" x2="2718.9" y2="314.07" href="#Áåçûìÿííûé_ãðàäèåíò_24" />
                    <linearGradient id="Áåçûìÿííûé_ãðàäèåíò_3-2" x1="2563.19" y1="306.25" x2="2797.82" y2="306.25" href="#Áåçûìÿííûé_ãðàäèåíò_3" />
                    <linearGradient id="Áåçûìÿííûé_ãðàäèåíò_3-3" x1="2602.93" y1="319.57" x2="2662.99" y2="319.57" href="#Áåçûìÿííûé_ãðàäèåíò_3" />
                    <linearGradient id="Áåçûìÿííûé_ãðàäèåíò_3-4" x1="2473.55" y1="254.25" x2="2708.18" y2="254.25" href="#Áåçûìÿííûé_ãðàäèåíò_3" />
                    <linearGradient id="Áåçûìÿííûé_ãðàäèåíò_3-5" x1="2458.11" y1="237.02" x2="2518.17" y2="237.02" href="#Áåçûìÿííûé_ãðàäèåíò_3" />
                    <linearGradient id="Áåçûìÿííûé_ãðàäèåíò_2" x1="320.94" y1="66.6" x2="388.03" y2="66.6">
                        <stop offset="0" stopColor="#5761d7" />
                        <stop offset=".07" stopColor="#5472d8" />
                        <stop offset=".28" stopColor="#4e9cdb" />
                        <stop offset=".48" stopColor="#49bddd" />
                        <stop offset=".67" stopColor="#45d5df" />
                        <stop offset=".85" stopColor="#43e3e0" />
                        <stop offset="1" stopColor="#42e8e0" />
                    </linearGradient>
                    <linearGradient id="Dégradé_sans_nom_97" x1="468.34" y1="195.38" x2="527.19" y2="195.38">
                        <stop offset="0" stopColor="#3199c9" />
                        <stop offset="1" stopColor="#14288f" />
                    </linearGradient>
                    <linearGradient id="Dégradé_sans_nom_87" x1="466.57" y1="153.8" x2="528.96" y2="153.8">
                        <stop offset="0" stopColor="#443991" />
                        <stop offset=".25" stopColor="#39b2c1" />
                        <stop offset="1" stopColor="#24126a" />
                    </linearGradient>
                    <linearGradient id="Dégradé_sans_nom_29" x1="4.65" y1="17.73" x2="55.33" y2="17.73" href="#Dégradé_sans_nom_97" />
                    <linearGradient id="Dégradé_sans_nom_94" x1="472.42" y1="143.94" x2="536.33" y2="143.94">
                        <stop offset="0" stopColor="#24126a" />
                        <stop offset=".17" stopColor="#24146b" />
                        <stop offset=".26" stopColor="#251c70" />
                        <stop offset=".33" stopColor="#272a77" />
                        <stop offset=".38" stopColor="#2a3d81" />
                        <stop offset=".44" stopColor="#2d558f" />
                        <stop offset=".49" stopColor="#3274a0" />
                        <stop offset=".53" stopColor="#3798b4" />
                        <stop offset=".57" stopColor="#3dc1ca" />
                        <stop offset=".61" stopColor="#42e8e0" />
                        <stop offset=".64" stopColor="#43d1d5" />
                        <stop offset=".7" stopColor="#44a4c1" />
                        <stop offset=".76" stopColor="#457eaf" />
                        <stop offset=".82" stopColor="#4661a2" />
                        <stop offset=".88" stopColor="#474d99" />
                        <stop offset=".94" stopColor="#474093" />
                        <stop offset="1" stopColor="#473c91" />
                    </linearGradient>
                    <linearGradient id="Dégradé_sans_nom_29-2" x1="467.06" y1="150.63" x2="528.47" y2="150.63" href="#Dégradé_sans_nom_97" />
                    <radialGradient id="Áåçûìÿííûé_ãðàäèåíò_211" cx="-2190.47" cy="-516.42" r="93.46">
                        <stop offset="0" stopColor="#42e8e0" />
                        <stop offset=".15" stopColor="#33aeb9" />
                        <stop offset=".31" stopColor="#267a95" />
                        <stop offset=".47" stopColor="#1b5078" />
                        <stop offset=".62" stopColor="#132e61" />
                        <stop offset=".76" stopColor="#0d1651" />
                        <stop offset=".89" stopColor="#090847" />
                        <stop offset="1" stopColor="#080344" />
                    </radialGradient>
                    <radialGradient id="Áåçûìÿííûé_ãðàäèåíò_211-2" cx="-2148.62" cy="-169.81" r="63.13" href="#Áåçûìÿííûé_ãðàäèåíò_211" />
                    <clipPath id="clip-path" transform="translate(-57.49 -117.47)">
                        <path id="SVGID" class="cls-1" d="m329.47 133.68-138.55 79.99 17.18 101.29 138.46-79.94-17.09-101.34z" />
                    </clipPath>
                </defs>
                <g className="cls-2">
                    <g id="Ñëîé_1" data-name="Ñëîé 1">
                        <g className="animate-reverse">
                            <g id="class-1" className="cls-3">
                                <path id="class-3" className="cls-4" d="m60 287.5 139.83-80.73 230.32 133.12a3 3 0 0 1 0 5.19L300.36 420a11.07 11.07 0 0 1-11.1 0Z" transform="translate(-57.49 -117.47)" />
                            </g>
                            <g id="class-2" className="cls-5">
                                <path id="class-4" className="cls-6" d="m60 273.22 139.83-80.73 230.32 133.12a3 3 0 0 1 0 5.2l-129.79 74.93a11.11 11.11 0 0 1-11.1 0Z" transform="translate(-57.49 -117.47)" />
                            </g>
                            <path id="class-5" className="cls-7" d="m60 259 139.83-80.73 230.32 133.07a3 3 0 0 1 0 5.19l-129.79 74.93a11.07 11.07 0 0 1-11.1 0Z" transform="translate(-57.49 -117.47)" />
                            <ellipse id="class-6" className="cls-12" cx="114.47" cy="66.09" rx="114.47" ry="66.09" />
                            <ellipse id="class-7" className="cls-13" cx="378.39" cy="260.32" rx="77.32" ry="44.64" />
                        </g>
                        <g className="animate">
                            <path className="cls-8" d="m114.24 114.32-25.98-15 25.98-15 25.98 15-25.98 15z" />
                            <path className="cls-9" d="m114.24 97.04-25.98-15 25.98-15.01 25.98 15.01-25.98 15z" />
                            <path className="cls-10" d="M114.24 83.19 88.26 68.18l25.98-15 25.98 15-25.98 15.01z" />
                            <path className="cls-11" d="M171.73 201.39a.68.68 0 0 1-.36-.1l-26-15a.74.74 0 0 1 0-1.28l26-15a.75.75 0 0 1 .74 0l26 15a.74.74 0 0 1 0 1.28l-26 15a.69.69 0 0 1-.38.1Zm-24.51-15.74 24.51 14.15 24.51-14.15-24.51-14.15Z" transform="translate(-57.49 -117.47)" />
                        </g>
                        <g className="animate cls-14">
                            <path className="cls-11" d="M294.94 393.53a12.9 12.9 0 0 1-6.48-1.74l-74.73-43.14a3.74 3.74 0 0 1 0-6.48l135.21-78.06a.73.73 0 0 1 .73 0l80.85 46.67a3.74 3.74 0 0 1 0 6.48l-129.1 74.53a12.9 12.9 0 0 1-6.48 1.74Zm54.37-127.93-134.84 77.85a2.26 2.26 0 0 0 0 3.92l74.73 43.15a11.75 11.75 0 0 0 11.49 0L429.78 316a2.27 2.27 0 0 0 0-3.93Z" transform="translate(-57.49 -117.47)" id="class-8" />
                        </g>
                        <g className="animate">
                            <path className="cls-15" d="m349.47 234-18-106.7 1.44-.61-2.17-1.24a1.57 1.57 0 0 0-1.68.11l-143.73 83a4.06 4.06 0 0 0-1.87 3.65l18.13 107.55a1.32 1.32 0 0 0 .76 1.09l2.15 1.15.37-2h-.13l142.87-82.4a4 4 0 0 0 1.86-3.6Z" transform="translate(-57.49 -117.47)" id="class-9" />
                            <path className="cls-16" d="m186.16 211.43-2.36-1.05a3.23 3.23 0 0 0-.31 1.78l18.13 107.55a1.32 1.32 0 0 0 .76 1.09l2.12 1.2.37-2h-.13l7.23-4.17Z" transform="translate(-57.49 -117.47)" id="class-10" />
                            <path className="cls-11" d="m349.47 234-18-106.7 1.1-.46c-.38-.68-1.16-.83-2.06-.31l-143.73 83a4.08 4.08 0 0 0-1.87 3.65l18.13 107.55a1.77 1.77 0 0 0 .27.7l.85.48a1.47 1.47 0 0 0 .36 0l.33-1.78h-.13l142.89-82.53a4 4 0 0 0 1.86-3.6Z" transform="translate(-57.49 -117.47)" />
                            <path className="cls-17" d="m349.86 238.89-143.73 83c-1.11.64-2.06.27-2.26-.88l-18.12-107.56a4 4 0 0 1 1.86-3.65l143.74-83c1.11-.64 2.06-.27 2.25.88l18.13 107.54a4 4 0 0 1-1.87 3.67Z" transform="translate(-57.49 -117.47)" />
                            <g id="class-11" className="cls-18">
                                <path id="class-12" className="cls-19" d="M271.97 16.22 133.43 96.21l17.18 101.28 138.45-79.93-17.09-101.34z" />
                            </g>
                            <path className="cls-20" d="m440.21 289.81-7.84 4.1-78.66-45.41a5.69 5.69 0 0 0-5.13.21L212.92 327c-1.29-.72-7.21-3.57-7.21-3.57l2.87 7.48a1.72 1.72 0 0 0 .8.89l82.84 47.83a5.74 5.74 0 0 0 5.14-.21l138.81-80.15a2.49 2.49 0 0 0 1.17-1.24Z" transform="translate(-57.49 -117.47)" id="class-13" />
                            <path className="cls-21" d="m439 291.1-142.27 82.14a5.84 5.84 0 0 1-5.26.22l-84.9-49c-1.35-.78-1.18-2.14.38-3l142.27-82.14a5.84 5.84 0 0 1 5.26-.22l84.9 49c1.35.74 1.18 2.1-.38 3Z" transform="translate(-57.49 -117.47)" id="class-14" />
                            <path className="cls-22" d="m439 290.28-142.27 82.14a5.84 5.84 0 0 1-5.26.22l-84.9-49a1.74 1.74 0 0 1-.83-.91 1.44 1.44 0 0 0 .83 1.73l84.9 49a5.84 5.84 0 0 0 5.26-.22L439 291.1c1.05-.6 1.45-1.41 1.2-2.12a2.52 2.52 0 0 1-1.2 1.3Z" transform="translate(-57.49 -117.47)" id="class-15" />
                            <path className="cls-23" d="M253.82 355.47v-1.56c0-.15.09-.21.2-.15l5.5 3.18a.47.47 0 0 1 .2.38v1.56c0 .15-.09.22-.2.15l-5.5-3.17a.5.5 0 0 1-.2-.39ZM262 360.22v-1.56c0-.14.09-.21.21-.15l5.5 3.18a.48.48 0 0 1 .2.38v1.56c0 .15-.09.22-.2.16l-5.5-3.18a.48.48 0 0 1-.21-.39Z" transform="translate(-57.49 -117.47)" />
                            <path className="cls-24" d="m228.7 319.85 118.23-68.26a2.58 2.58 0 0 1 2.55 0l42.1 24.41a.91.91 0 0 1 0 1.57L273.4 345.75a2.51 2.51 0 0 1-2.54 0l-42.16-24.33a.91.91 0 0 1 0-1.57Z" transform="translate(-57.49 -117.47)" id="class-16" />
                            <path className="cls-25" d="m228.7 321.42.43.25 117.8-68a2.55 2.55 0 0 1 2.55 0l41.67 24.11.43-.25a.91.91 0 0 0 0-1.57l-42.1-24.36a2.58 2.58 0 0 0-2.55 0L228.7 319.85a.91.91 0 0 0 0 1.57Z" transform="translate(-57.49 -117.47)" />
                            <path className="cls-17" d="m295.16 140.3-102.7 59.29-4.56-2.64 102.7-59.29 4.56 2.64zM306.36 146.76l-96.33 55.62-4.57-2.64 96.33-55.61 4.57 2.63zM313.65 150.97l-113.42 65.48-4.56-2.64 113.41-65.47 4.57 2.63zM320.94 155.18l-113.41 65.48-4.57-2.64 113.41-65.48 4.57 2.64zM328.23 159.39l-113.41 65.48-4.57-2.64 113.41-65.48 4.57 2.64zM186.26 203.17l-4.57 2.64-4.56-2.64 4.56-2.63 4.57 2.63zM202.37 206.8l-9.48 5.47-4.57-2.63 9.48-5.48 4.57 2.64z" />
                            <path className="cls-17" d="M351.48 336.37 383.36 318a1.38 1.38 0 0 0 0-2.61l-21.8-12.59a5 5 0 0 0-4.51 0l-31.88 18.41c-1.25.72-1.25 1.89 0 2.6L347 336.37a5 5 0 0 0 4.48 0Z" transform="translate(-57.49 -117.47)" id="class-17" />
                            <path className="cls-25" d="m325.17 322.25 31.88-18.41a5 5 0 0 1 4.51 0l21.8 12.59a1.92 1.92 0 0 1 .78.77c.33-.63.08-1.34-.78-1.84l-21.8-12.59a5 5 0 0 0-4.51 0l-31.88 18.41c-.86.5-1.11 1.21-.78 1.84a1.86 1.86 0 0 1 .78-.77Z" transform="translate(-57.49 -117.47)" />
                            <g class="code">
                                <polygon class="cls-11" points="190.12 80.01 173.81 89.44 173.48 87.49 189.79 78.06 190.12 80.01"></polygon>
                                <polygon class="cls-11" points="195.87 76.69 191.83 79.02 191.5 77.07 195.54 74.74 195.87 76.69"></polygon>
                                <polygon class="cls-11" points="178.98 91.33 174.56 93.88 174.23 91.94 178.65 89.38 178.98 91.33"></polygon>
                                <polygon class="cls-11" points="189.35 85.34 180.69 90.34 180.36 88.39 189.02 83.39 189.35 85.34"></polygon>
                                <polygon class="cls-11" points="193.8 82.76 191.06 84.35 190.73 82.4 193.47 80.81 193.8 82.76"></polygon>
                                <polygon class="cls-11" points="204.25 76.73 195.59 81.74 195.26 79.79 203.92 74.78 204.25 76.73"></polygon>
                                <polygon class="cls-11" points="208.71 74.16 205.97 75.74 205.64 73.8 208.38 72.21 208.71 74.16"></polygon>
                                <polygon class="cls-11" points="184.35 93.1 175.31 98.33 174.98 96.38 184.02 91.16 184.35 93.1"></polygon>
                                <polygon class="cls-11" points="192.6 88.33 186.06 92.11 185.73 90.17 192.27 86.39 192.6 88.33"></polygon>
                                <polygon class="cls-11" points="198.73 84.79 194.31 87.34 193.98 85.4 198.4 82.84 198.73 84.79"></polygon>
                                <polygon class="cls-11" points="205.11 81.11 200.69 83.67 200.36 81.72 204.78 79.17 205.11 81.11"></polygon>
                                <polygon class="cls-11" points="215.48 75.12 206.82 80.13 206.49 78.18 215.15 73.17 215.48 75.12"></polygon>
                                <polygon class="cls-11" points="219.94 72.55 217.19 74.13 216.87 72.18 219.61 70.6 219.94 72.55"></polygon>
                                <polygon class="cls-11" points="185.16 97.52 176.12 102.75 175.79 100.8 184.83 95.58 185.16 97.52"></polygon>
                                <polygon class="cls-11" points="193.41 92.75 186.87 96.53 186.54 94.59 193.08 90.81 193.41 92.75"></polygon>
                                <polygon class="cls-11" points="199.54 89.21 195.12 91.77 194.79 89.82 199.21 87.27 199.54 89.21"></polygon>
                                <polygon class="cls-11" points="205.86 85.56 201.44 88.12 201.11 86.17 205.53 83.62 205.86 85.56"></polygon>
                                <polygon class="cls-11" points="224.53 74.8 208.22 84.22 207.89 82.28 224.2 72.85 224.53 74.8"></polygon>
                                <polygon class="cls-11" points="230.28 71.47 226.24 73.81 225.91 71.86 229.95 69.53 230.28 71.47"></polygon>
                                <polygon class="cls-11" points="241.59 64.95 232.55 70.18 232.22 68.23 241.26 63.01 241.59 64.95"></polygon>
                                <polygon class="cls-11" points="249.84 60.19 243.3 63.97 242.97 62.02 249.51 58.24 249.84 60.19"></polygon>
                                <polygon class="cls-11" points="255.97 56.64 251.55 59.2 251.22 57.25 255.64 54.7 255.97 56.64"></polygon>
                                <polygon class="cls-11" points="177.29 109.72 181.33 107.39 181.66 109.34 177.62 111.67 177.29 109.72"></polygon>
                                <polygon class="cls-11" points="179.92 105.43 176.87 107.2 176.54 105.25 179.59 103.48 179.92 105.43"></polygon>
                                <polygon class="cls-11" points="185.67 102.11 181.63 104.44 181.31 102.49 185.34 100.16 185.67 102.11"></polygon>
                                <polygon class="cls-11" points="193.88 97.36 187.38 101.12 187.05 99.17 193.56 95.41 193.88 97.36"></polygon>
                                <polygon class="cls-11" points="183.04 106.4 186.1 104.64 186.43 106.58 183.37 108.35 183.04 106.4"></polygon>
                                <polygon class="cls-11" points="183.42 110.97 187.46 108.64 187.79 110.58 183.75 112.92 183.42 110.97"></polygon>
                                <polygon class="cls-11" points="189.17 107.65 192.23 105.88 192.56 107.83 189.5 109.59 189.17 107.65"></polygon>
                                <polygon class="cls-11" points="184.12 115.45 186.86 113.87 187.19 115.81 184.45 117.4 184.12 115.45"></polygon>
                                <polygon class="cls-11" points="188.58 112.88 197.24 107.87 197.56 109.82 188.91 114.82 188.58 112.88"></polygon>
                                <polygon class="cls-11" points="191.25 116.24 193.99 114.65 194.32 116.6 191.58 118.19 191.25 116.24"></polygon>
                                <polygon class="cls-11" points="195.52 113.77 198.26 112.18 198.59 114.13 195.85 115.71 195.52 113.77"></polygon>
                                <polygon class="cls-11" points="199.95 111.21 203.01 109.44 203.34 111.39 200.28 113.16 199.95 111.21"></polygon>
                                <polygon class="cls-11" points="204.31 108.7 211.63 104.47 211.96 106.41 204.64 110.64 204.31 108.7"></polygon>
                                <polygon class="cls-11" points="212.94 103.72 217.29 101.2 217.62 103.14 213.26 105.66 212.94 103.72"></polygon>
                                <polygon class="cls-11" points="192.05 121.01 194.79 119.43 195.12 121.37 192.38 122.96 192.05 121.01"></polygon>
                                <polygon class="cls-11" points="196.51 118.44 205.17 113.43 205.5 115.38 196.84 120.39 196.51 118.44"></polygon>
                                <polygon class="cls-11" points="192.8 125.44 196.84 123.11 197.16 125.05 193.13 127.38 192.8 125.44"></polygon>
                                <polygon class="cls-11" points="198.55 122.11 201.6 120.35 201.93 122.3 198.88 124.06 198.55 122.11"></polygon>
                                <polygon class="cls-11" points="193.5 129.92 196.24 128.33 196.57 130.28 193.83 131.86 193.5 129.92"></polygon>
                                <polygon class="cls-11" points="197.95 127.34 206.61 122.34 206.94 124.28 198.28 129.29 197.95 127.34"></polygon>
                                <polygon class="cls-11" points="187.99 138 190.73 136.41 191.06 138.36 188.32 139.95 187.99 138"></polygon>
                                <polygon class="cls-11" points="192.26 135.53 195.01 133.94 195.34 135.89 192.59 137.47 192.26 135.53"></polygon>
                                <polygon class="cls-11" points="196.72 132.95 205.48 127.89 205.81 129.84 197.05 134.9 196.72 132.95"></polygon>
                                <polygon class="cls-11" points="207.35 127.16 213.86 123.4 214.19 125.34 207.68 129.1 207.35 127.16"></polygon>
                                <polygon class="cls-11" points="188.74 142.44 195.24 138.69 195.57 140.63 189.07 144.39 188.74 142.44"></polygon>
                                <polygon class="cls-11" points="196.96 137.7 200.99 135.37 201.32 137.31 197.28 139.64 196.96 137.7"></polygon>
                                <polygon class="cls-11" points="202.7 134.37 205.76 132.61 206.09 134.56 203.03 136.32 202.7 134.37"></polygon>
                                <polygon class="cls-11" points="194.47 143.99 198.88 141.44 199.21 143.38 194.79 145.94 194.47 143.99"></polygon>
                                <polygon class="cls-11" points="184.09 149.98 192.75 144.98 193.08 146.93 184.42 151.93 184.09 149.98"></polygon>
                                <polygon class="cls-11" points="190.77 151.04 184.85 154.46 185.18 156.4 191.1 152.98 190.77 151.04"></polygon>
                                <polygon class="cls-11" points="193.1 149.69 195.85 148.1 196.18 150.05 193.43 151.63 193.1 149.69"></polygon>
                                <polygon class="cls-11" points="197.38 147.22 200.12 145.63 200.45 147.58 197.71 149.16 197.38 147.22"></polygon>
                                <polygon class="cls-11" points="201.83 144.64 210.6 139.57 210.93 141.52 202.16 146.59 201.83 144.64"></polygon>
                                <polygon class="cls-11" points="212.31 138.59 221.67 133.18 222 135.13 212.64 140.53 212.31 138.59"></polygon>
                                <polygon class="cls-11" points="223.68 132.02 228.09 129.46 228.42 131.41 224 133.96 223.68 132.02"></polygon>
                                <polygon class="cls-11" points="229.81 128.47 236.35 124.69 236.67 126.64 230.14 130.42 229.81 128.47"></polygon>
                                <polygon class="cls-11" points="238.06 123.7 247.1 118.48 247.43 120.43 238.39 125.65 238.06 123.7"></polygon>
                                <polygon class="cls-11" points="185.6 158.88 196.81 152.4 197.13 154.34 185.93 160.82 185.6 158.88"></polygon>
                                <polygon class="cls-11" points="198.61 151.36 204.72 147.83 205.04 149.78 198.94 153.31 198.61 151.36"></polygon>
                                <polygon class="cls-11" points="206.54 146.79 209.28 145.2 209.61 147.15 206.87 148.73 206.54 146.79"></polygon>
                                <polygon class="cls-11" points="211 144.21 212.51 143.34 212.84 145.28 211.32 146.16 211 144.21"></polygon>
                                <polygon class="cls-11" points="214.22 142.35 218.64 139.79 218.97 141.74 214.55 144.29 214.22 142.35"></polygon>
                                <polygon class="cls-11" points="220.67 138.65 225.09 136.1 225.42 138.04 221 140.6 220.67 138.65"></polygon>

                                <polygon class="cls-11" points="226.81 135.11 233.34 131.33 233.67 133.27 227.13 137.05 226.81 135.11"></polygon>
                                <polygon class="cls-11" points="235.06 130.34 244.1 125.11 244.43 127.06 235.38 132.28 235.06 130.34"></polygon>
                            </g>
                        </g>
                        <g className="animate-coffee-support">
                            <path className="cls-10" transform="translate(-10.49 -275.47)" d="m383.4 411.6-35.8-20.7 35.8-20.7 35.8 20.7z" />
                            <path className="cls-11" d="M383.4 412.6c-.2 0-.4 0-.5-.1l-35.8-20.7c-.3-.2-.5-.5-.5-.9s.2-.7.5-.9l35.8-20.7c.3-.2.7-.2 1 0l35.8 20.7c.3.2.5.5.5.9s-.2.7-.5.9l-35.8 20.7c-.2 0-.3.1-.5.1zm-33.8-21.7 33.8 19.5 33.8-19.5-33.8-19.5-33.8 19.5z" transform="translate(-10.49 -275.47)" />
                        </g>
                        <g className="animate">
                            <path className="cls-10" transform="translate(182.49 233.47)" d="M114.24 83.19 88.26 68.18l25.98-15 25.98 15-25.98 15.01z" />
                            <path className="cls-11" d="M171.73 201.39a.68.68 0 0 1-.36-.1l-26-15a.74.74 0 0 1 0-1.28l26-15a.75.75 0 0 1 .74 0l26 15a.74.74 0 0 1 0 1.28l-26 15a.69.69 0 0 1-.38.1Zm-24.51-15.74 24.51 14.15 24.51-14.15-24.51-14.15Z" transform="translate(125.49 115.47)" />
                            <path className="cls-10" d="m378.39 268.19-13.63-7.87 13.63-7.87 13.63 7.87-13.63 7.87z" />
                            <path className="cls-9" d="m378.39 260.32-13.63-7.87 13.63-7.87 13.63 7.87-13.63 7.87z" />
                            <path className="cls-8" d="m378.39 252.45-13.63-7.87 13.63-7.87 13.63 7.87-13.63 7.87z" />
                            <path className="cls-11" d="M435.88 386.39a.81.81 0 0 1-.37-.09l-13.63-7.88a.73.73 0 0 1 0-1.27l13.63-7.87a.75.75 0 0 1 .74 0l13.63 7.87a.73.73 0 0 1 0 1.27l-13.63 7.88a.78.78 0 0 1-.37.09Zm-12.16-8.6 12.16 7 12.16-7-12.16-7Z" transform="translate(-57.49 -117.47)" />
                            <path className="cls-10" d="m80.02 220.14-13.63-7.87 13.63-7.87 13.64 7.87-13.64 7.87z" />
                            <path className="cls-11" d="M137.52 338.35a.79.79 0 0 1-.37-.1l-13.64-7.87a.76.76 0 0 1-.37-.64.75.75 0 0 1 .37-.64l13.64-7.87a.73.73 0 0 1 .73 0l13.64 7.87a.73.73 0 0 1 .37.64.74.74 0 0 1-.37.64l-13.64 7.87a.78.78 0 0 1-.36.1Zm-12.16-8.61 12.16 7 12.15-7-12.16-7Z" transform="translate(-57.49 -117.47)" />
                        </g>
                    </g>
                </g>
                <g className="animate-coffee">
                    <ellipse cx="29.99" cy="108.73" rx="20.66" ry="11.93" transform="translate(468 45)" id="class-18" />
                    <path d="M527.19 156.61h-58.85l5.47 63.72c0 3.54 2.34 7.07 7 9.77 9.35 5.4 24.52 5.4 33.87 0 4.68-2.7 7-6.23 7-9.77Z" transform="translate(.49 -90.47)" id="class-19" />
                    <path d="M527.19 156.61h-58.85l.9 10.48a22.92 22.92 0 0 0 5.45 4.91c11.25 7.46 29.8 8.9 42.46 3.53l-1.95 46.6a9.15 9.15 0 0 1-2.11 5.55c-1.9 2.25-5.58 4.89-12.64 6.38a33.16 33.16 0 0 0 14.25-4c4.68-2.7 7-6.23 7-9.77l4.39-51.1Z" transform="translate(.49 -90.47)" id="class-20" />
                    <ellipse className="tld-4" cx="31.19" cy="23.72" rx="29.42" ry="16.99" transform="translate(.49 -90.47)" />
                    <ellipse className="tld-4" cx="31.19" cy="17.73" rx="25.34" ry="14.63" transform="translate(.49 -90.47)" />
                    <path d="M528.93 155.81a.28.28 0 0 1 0-.09l-.57-5.71v.07c-.25-4.32-3.23-8.6-8.94-11.89-11.94-6.9-31.31-6.9-43.26 0-5.85 3.38-8.83 7.79-8.95 12.21l-.54 5.08v.48c-.32 4.84 2.71 9.74 9.11 13.44 12.19 7 31.94 7 44.12 0 6.36-3.78 9.4-8.72 9.03-13.59Z" transform="translate(.49 -90.47)" id="class-21" />
                    <ellipse cx="29.99" cy="17.73" rx="25.34" ry="14.63" transform="translate(.49 -90.47)" id="class-22" />
                    <path className="tld-4" d="M483.34 51.99c9.9-5.72 25.94-5.72 35.84 0 .13.07.23.15.35.22a19.82 19.82 0 0 0-3.36-2.4c-9.89-5.72-25.94-5.72-35.84 0s-9.84 14.72-.35 20.46c-6.36-5.66-5.25-13.31 3.36-18.28Z" />
                    <path d="M479.84 142.82c9.9-5.72 26-5.72 35.84 0 4.39 2.53 6.83 5.76 7.33 9.08.62-4.16-1.82-8.44-7.33-11.62-9.89-5.72-25.94-5.72-35.84 0-5.51 3.18-7.94 7.46-7.32 11.61.48-3.31 2.93-6.54 7.32-9.07Z" transform="translate(.49 -90.47)" id="class-23" />
                    <path d="M519.58 138.28c-11.93-7-31.37-7.2-43.42-.38s-12.15 18-.22 25.07 31.37 7.2 43.42.38 12.15-18.04.22-25.07Zm-3.9 22.72a32.87 32.87 0 0 1-11.52 3.8l-.46-1.51a1.46 1.46 0 0 0-1.39-1h-9.1a1.44 1.44 0 0 0-1.38 1l-.46 1.51a33 33 0 0 1-11.53-3.8c-9.89-5.71-9.89-15 0-20.69s26-5.72 35.84 0 9.9 14.95 0 20.69Z" transform="translate(.49 -90.47)" id="class-24" />
                    <path d="M500.48 164.09H495a.67.67 0 0 0-.68.68v.1a1.13 1.13 0 0 0 0 .18.68.68 0 0 1 .65-.5h5.44a.67.67 0 0 1 .65.5.58.58 0 0 0 0-.18v-.1a.68.68 0 0 0-.58-.68Z" transform="translate(.49 -90.47)" id="class-25" />
                    <path className="tld-10" d="M496.98 126.53a4.89 4.89 0 1 1-9.45-2.51c.69-2.61 3.15-3.35 5.76-2.65s4.38 2.51 3.69 5.16ZM500.82 121.34a2.16 2.16 0 1 1-3-3.09c1-1 2.85-1.44 3.69-.58s.3 2.71-.69 3.67ZM495.71 117.25a2.16 2.16 0 1 1-4.22-.72c.24-1.36 1.49-2.83 2.67-2.62s1.79 1.99 1.55 3.34ZM489.41 116.63a2.163 2.163 0 1 1-4 1.65c-.52-1.28-.26-3.19.84-3.64s2.64.72 3.16 1.99Z" />
                </g>
            </svg>
        </p>
    );
}